Plan for **staging** is ready.
**Branch/Commit:** refs/heads/staging / a086f0e7855a48787da07308583c376db9d76f41
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/19804879651

**Plan (last ~500 lines):**
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.helm.helm_release.external_dns["this"] will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = true
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "cloudflare.proxied"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].name"
          + value = "CF_API_TOKEN"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].valueFrom.secretKeyRef.key"
          + value = "api-token"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "env[0].valueFrom.secretKeyRef.name"
          + value = "cloudflare-api-key"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "policy"
          + value = "sync"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "provider"
          + value = "cloudflare"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "registry"
          + value = "txt"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
            # (1 unchanged attribute hidden)
        }
    }

  # module.helm.kubernetes_secret.cloudflare_api_key will be updated in-place
  ~ resource "kubernetes_secret" "cloudflare_api_key" {
      ~ data                           = (sensitive value)
        id                             = "kube-system/cloudflare-api-key"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
